{"_id":{"$oid":"64a878a24e898f416195fee1"},"Title":"Good Will Hunting","Description":"Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.","Genre":{"Name":"Drama","Description":"A Drama film is Narrative fiction (or semi-fiction) intended to be more serious in tone."},"Director":{"Name":"Gus Van Sant","Bio":"Gus Green Van Sant Jr. is an American film director, producer, photographer, and musician. He has earned acclaim as both an independent and mainstream filmmaker. His films typically deal with themes of marginalized subcultures, in particular homosexuality.","Born":{"$date":{"$numberLong":"-550368000000"}},"Movies":[[{"$oid":"64a878a24e898f416195fee1"}]]},"ImagePath":"goodwillhunting.png","Featured":true,"Actors":[{"Name":"Robin Williams","Bio":"Robin Williams, in full Robin McLaurin Williams, was an American comedian and actor known for his manic stand-up routines and his diverse film performances. He won an Academy Award for his role in Good Will Hunting (1997).","Born":{"$date":{"$numberLong":"-582249600000"}},"Death":{"$date":"2014-08-11T00:00:00Z"}},{"Name":"Matt Damon","Bio":"Matthew Paige Damon is an American actor, film producer, and screenwriter. Ranked among Forbes' most bankable stars, the films in which he has appeared have collectively earned over $3.88 billion at the North American box office, making him one of the highest-grossing actors of all time.","Born":{"$date":"1970-10-08T00:00:00Z"}},{"Name":"Ben Affleck","Bio":"Benjamin Géza Affleck is an American actor and filmmaker. His accolades include two Academy Awards. Affleck began his career as a child when he starred in the PBS educational series The Voyage of the Mimi.","Born":{"$date":"1972-08-15T00:00:00Z"}}]}
{"_id":{"$oid":"64a87ad14e898f416195fee2"},"Title":"The Social Network","Description":"As Harvard student Mark Zuckerberg creates the social networking site that would become known as Facebook, he is sued by the twins who claimed he stole their idea and by the co-founder who was later squeezed out of the business.","Genre":{"Name":"Drama","Description":"A Drama film is Narrative fiction (or semi-fiction) intended to be more serious in tone."},"Director":{"Name":"David Fincher","Bio":"David Andrew Leo Fincher is an American filmmaker. His films, most of which are psychological thrillers, have collectively grossed over $2.1 billion worldwide and have received 10 Academy Award nominations; this includes three Best Director nominations for him.","Born":{"$date":{"$numberLong":"-231811200000"}},"Movies":[[{"$oid":"64a87ad14e898f416195fee2"}]]},"ImagePath":"thesocialnetwork.png","Featured":true,"Actors":[{"Name":"Jesse Eisenberg","Bio":"Jesse Adam Eisenberg is an American actor, writer and filmmaker. He has received various accolades, including nominations for an Academy Award, two BAFTA Awards, and a Golden Globe Award. Eisenberg made his television debut with the short-lived comedy-drama series Get Real.","Born":{"$date":"1983-10-05T00:00:00Z"}},{"Name":"Andrew Garfield","Bio":"Andrew Russell Garfield is an English and American actor. He has received various accolades, including a Tony Award, a BAFTA TV Award and a Golden Globe Award, in addition to nominations for a Primetime Emmy Award, a Laurence Olivier Award and two Academy Awards.","Born":{"$date":"1983-08-20T00:00:00Z"}},{"Name":"Justin Timberlake","Bio":"Justin Randall Timberlake is an American singer, songwriter, and actor. He is one of the world's best-selling music artists, with sales of over 88 million records.","Born":{"$date":"1981-01-31T00:00:00Z"}}]}
{"_id":{"$oid":"64a9c4b04e898f416195fefa"},"Title":"Django Unchained","Description":"With the help of a German bounty-hunter, a freed slave sets out to rescue his wife from a brutal plantation owner in Mississippi.","Genre":{"Name":"Western","Description":"A genre of fiction set in the American frontier and commonly associated with folk tales of the Western United States."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, writer, producer, and actor. His films are characterized by stylized violence, extended dialogue including a pervasive use of profanity, and references to popular culture.","Born":{"$date":{"$numberLong":"-213580800000"}},"Movies":[[{"$oid":"64a9c4b04e898f416195fefa"}]]},"ImagePath":"djangounchained.png","Featured":false,"Actors":[{"Name":"Jamie Foxx","Bio":"Eric Marlon Bishop, known professionally as Jamie Foxx, is an American actor, comedian, and singer. He received acclaim for his portrayal of Ray Charles in the film Ray, winning the Academy Award, BAFTA, Screen Actors Guild Award, and Golden Globe Award for Best Actor.","Born":{"$date":{"$numberLong":"-64800000000"}}},{"Name":"Christoph Waltz","Bio":"Christoph Waltz is a German actor. He is known for playing villainous and supporting roles in English-language films since 2009; he has been primarily active in the United States. His accolades include two Academy Awards, two Golden Globe Awards, two BAFTA Awards and two Screen Actors Guild Awards.","Born":{"$date":{"$numberLong":"-417916800000"}}},{"Name":"Leonardo DiCaprio","Bio":"Leonardo Wilhelm DiCaprio is an American actor and film producer. Known for his work in biographical and period films, he is the recipient of numerous accolades, including an Academy Award, a British Academy Film Award and three Golden Globe Awards.","Born":{"$date":"1974-11-11T00:00:00Z"}}]}
{"_id":{"$oid":"64a9c5324e898f416195fefb"},"Title":"Scott Pilgrim vs. the World","Description":"In a magically realistic version of Toronto, a young man must defeat his new girlfriend''s seven evil exes one by one in order to win her heart.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Edgar Wright","Bio":"Edgar Howard Wright is an English filmmaker. He is known for his fast-paced and kinetic, satirical genre films, which feature extensive utilisation of expressive popular music, Steadicam tracking shots, dolly zooms and a signature editing style that includes transitions, whip pans and wipes.","Born":{"$date":"1974-04-18T00:00:00Z"},"Movies":[[{"$oid":"64a9c5324e898f416195fefb"}]]},"ImagePath":"scottpilgrimvstheworld.png","Featured":false,"Actors":[{"Name":"Michael Cera","Bio":"Michael Austin Cera is a Canadian actor. He is known for his awkward, offbeat characters in coming of age comedy films and for portraying George Michael Bluth in the sitcom Arrested Development.","Born":{"$date":"1988-06-07T00:00:00Z"}},{"Name":"Mary Elizabeth Winstead","Bio":"Mary Elizabeth Winstead is an American actress and singer. Her first significant role was that of Jessica Bennett on the NBC soap opera Passions. She went on to appear in series such as Tru Calling and films including the superhero film Sky High.","Born":{"$date":"1984-11-28T00:00:00Z"}},{"Name":"Kieran Culkin","Bio":"Kieran Kyle Culkin is an American actor. He began his career as a child actor in the films Home Alone, Father of the Bride, The Mighty, and The Cider House Rules.","Born":{"$date":"1982-09-30T00:00:00Z"}}]}
{"_id":{"$oid":"64a9c7004e898f416195fefd"},"Title":"Bottle Rocket","Description":"Three friends plan to pull off a simple robbery and go on the run.","Genre":{"Name":"Crime","Description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."},"Director":{"Name":"Wes Anderson","Bio":"Wesley Wales Anderson is an American filmmaker. His films are known for their eccentricity, unique visual and narrative styles, and frequent use of ensemble casts. They often contain themes of grief, loss of innocence, and dysfunctional families. Anderson is cited by some critics as a modern-day example of an auteur.","Born":{"$date":{"$numberLong":"-21168000000"}},"Movies":[[{"$oid":"64a9c7004e898f416195fefd"}]]},"ImagePath":"bottlerocket.png","Featured":true,"Actors":[{"Name":"Luke Wilson","Bio":"Luke Cunningham Wilson is an American actor. He is known for his roles in films such as Bottle Rocket, Rushmore, My Dog Skip, Legally Blonde, The Royal Tenenbaums, Idiocracy, You Kill Me, The Skeleton Twins, Meadowland and Brad's Status.","Born":{"$date":"1971-09-21T00:00:00Z"}},{"Name":"Owen Wilson","Bio":"Owen Cunningham Wilson is an American actor. He has had a long association with filmmaker Wes Anderson with whom he shared writing and acting credits for Bottle Rocket, Rushmore, and The Royal Tenenbaums, the last of which earned him a nomination for the Academy Award and BAFTA Award for Best Screenplay.","Born":{"$date":{"$numberLong":"-34473600000"}}}]}
{"_id":{"$oid":"64aa43564e898f416195fefe"},"Title":"Back to the Future","Description":"Marty McFly, a 17-year-old high school student, is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist Doc Brown.","Genre":{"Name":"Science Fiction","Description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena thatare not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, dinosaurs, mutants,interstellar travel, time travel, or other technologies."},"Director":{"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American filmmaker. He first came to public attention as the director of the action-adventure romantic comedy Romancing the Stone, the science-fiction comedy Back to the Future film trilogy, and the live-action/animated comedy Who Framed Roger Rabbit.","Born":{"$date":{"$numberLong":"-556502400000"}},"Movies":[[{"$oid":"64aa43564e898f416195fefe"}]]},"ImagePath":"backtothefuture.png","Featured":true,"Actors":[{"Name":"Michael J. Fox","Bio":"Michael Andrew Fox OC, known professionally as Michael J. Fox, is a Canadian and American activist and retired actor. Beginning his career in the 1970s, Fox rose to prominence portraying Alex P. Keaton on the NBC sitcom Family Ties and Marty McFly in the Back to the Future film trilogy.","Born":{"$date":{"$numberLong":"-270259200000"}}},{"Name":"Christopher Lloyd","Bio":"Christopher Allen Lloyd is an American actor. He has appeared in many theater productions, films, and on television since the 1960s. He is known for portraying Dr. Emmett \"Doc\" Brown in the Back to the Future trilogy and Jim Ignatowski in the comedy series Taxi, for which he won two Emmy Awards.","Born":{"$date":{"$numberLong":"-984441600000"}}}]}
{"_id":{"$oid":"64aa44124e898f416195feff"},"Title":"True Romance","Description":"In Detroit, a lonely pop culture geek marries a call girl, steals cocaine from her pimp, and tries to sell it in Hollywood. Meanwhile, the owners of the cocaine, the Mob, track them down in an attempt to reclaim it.","Genre":{"Name":"Crime","Description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."},"Director":{"Name":"Tony Scott","Bio":"Anthony David Leighton Scott was an English film director and producer. He was known for directing highly successful action and thriller films such as Top Gun, Beverly Hills Cop II, Days of Thunder, The Last Boy Scout, True Romance, Crimson Tide, Enemy of the State, Man on Fire, Déjà Vu, and Unstoppable.","Born":{"$date":{"$numberLong":"-805680000000"}},"Death":{"$date":"2012-08-19T00:00:00Z"},"Movies":[[{"$oid":"64aa44124e898f416195feff"}]]},"ImagePath":"trueromance.png","Featured":false,"Actors":[{"Name":"Christian Slater","Bio":"Christian Michael Leonard Slater is an American actor and producer. He made his film debut with a leading role in The Legend of Billie Jean and gained wider recognition for his breakthrough role as Jason \"J.D.\" Dean, a sociopathic high school student, in the satire Heathers.","Born":{"$date":{"$numberLong":"-11750400000"}}},{"Name":"Patricia Arquette","Bio":"Patricia Tiffany Arquette is an American actress. She made her feature film debut as Kristen Parker in A Nightmare on Elm Street 3: Dream Warriors.","Born":{"$date":{"$numberLong":"-54691200000"}}},{"Name":"Dennis Hopper","Bio":"Dennis Lee Hopper was an American actor, director and photographer. He attended the Actors Studio, made his first television appearance in 1954, and soon after appeared in two of the films that made James Dean famous, Rebel Without A Cause and Giant as well as Gunfight at the O.K. Corral.","Born":{"$date":{"$numberLong":"-1061164800000"}},"Death":{"$date":"2010-05-29T00:00:00Z"}}]}
{"_id":{"$oid":"64aa46074e898f416195ff00"},"Title":"Dead Poets Society","Description":"Maverick teacher John Keating uses poetry to embolden his boarding school students to new heights of self-expression.","Genre":{"Name":"Drama","Description":"A Drama film is Narrative fiction (or semi-fiction) intended to be more serious in tone."},"Director":{"Name":"Peter Weir","Bio":"Peter Lindsay Weir AM is a retired Australian film director. He is known for directing films crossing various genres over forty years with films such as Picnic at Hanging Rock, Gallipoli, Witness, Dead Poets Society, Fearless, The Truman Show, Master and Commander: The Far Side of the World, and The Way Back.","Born":{"$date":{"$numberLong":"-800409600000"}},"Movies":[[{"$oid":"64aa46074e898f416195ff00"}]]},"ImagePath":"deadpoetssociety.png","Featured":false,"Actors":[{"Name":"Robin Williams","Bio":"Robin Williams, in full Robin McLaurin Williams, was an American comedian and actor known for his manic stand-up routines and his diverse film performances. He won an Academy Award for his role in Good Will Hunting (1997).","Born":{"$date":{"$numberLong":"-582249600000"}},"Death":{"$date":"2014-08-11T00:00:00Z"}},{"Name":"Robert  Sean Leonard","Bio":"Robert Lawrence Leonard, known by his stage name Robert Sean Leonard, is an American actor. He is known for playing Dr. James Wilson in the television series House and Neil Perry in the film Dead Poets Society.","Born":{"$date":{"$numberLong":"-26524800000"}}},{"Name":"Ethan Hawke","Bio":"Ethan Green Hawke is an American actor, author and film director. He has received numerous nominations including for four Academy Awards, two Golden Globe Awards and a Tony Award. He made his film debut in Explorers, before making a breakthrough performance in Dead Poets Society.","Born":{"$date":"1970-11-06T00:00:00Z"}}]}
{"_id":{"$oid":"64aa47004e898f416195ff01"},"Title":"Interstellar","Description":"When Earth becomes uninhabitable in the future, a farmer and ex-NASA pilot, Joseph Cooper, is tasked to pilot a spacecraft, along with a team of researchers, to find a new planet for humans","Genre":{"Name":"Science Fiction","Description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena thatare not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, dinosaurs, mutants,interstellar travel, time travel, or other technologies."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Edward Nolan CBE is a British and American filmmaker. Known for his Hollywood blockbusters with complex storytelling, Nolan is considered a leading filmmaker of the 21st century. His films have grossed $5 billion worldwide.","Born":{"$date":"1970-07-30T00:00:00Z"},"Movies":[[{"$oid":"64ab0ba44e898f416195ff03"},{"$oid":"64aa47004e898f416195ff01"}]]},"ImagePath":"interstellar.png","Featured":true,"Actors":[{"Name":"Matthew McConaughey","Bio":"Matthew David McConaughey is an American actor. He had his breakout role with a supporting performance in the coming-of-age comedy Dazed and Confused. After a number of supporting roles, his first success as a leading man came in the legal drama A Time to Kill.","Born":{"$date":{"$numberLong":"-5011200000"}}},{"Name":"Anne Hathaway","Bio":"Anne Jacqueline Hathaway is an American actress. Her accolades include an Academy Award, a British Academy Film Award, a Golden Globe Award, and a Primetime Emmy Award. Her films have grossed over $6.8 billion worldwide, and she appeared on the Forbes Celebrity 100 list in 2009.","Born":{"$date":"1982-11-12T00:00:00Z"}},{"Name":"Jessica Chastain","Bio":"Jessica Chastain is an American actress of film, television and stage. As a final-year student at the Juilliard School, she was signed on for a talent holding deal by the television producer John Wells.","Born":{"$date":"1977-03-24T00:00:00Z"}},{"Name":"Matt Damon","Bio":"Matthew Paige Damon is an American actor, film producer, and screenwriter. Ranked among Forbes' most bankable stars, the films in which he has appeared have collectively earned over $3.88 billion at the North American box office, making him one of the highest-grossing actors of all time.","Born":{"$date":"1970-10-08T00:00:00Z"}}]}
{"_id":{"$oid":"64aa47034e898f416195ff02"},"Title":"Catch Me If You Can","Description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.","Genre":{"Name":"Crime","Description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. A major figure of the New Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director in history.","Born":{"$date":{"$numberLong":"-727056000000"}},"Movies":[[{"$oid":"64aa47034e898f416195ff02"}]]},"ImagePath":"catchmeifyoucan.png","Featured":false,"Actors":[{"Name":"Leonardo DiCaprio","Bio":"Leonardo Wilhelm DiCaprio is an American actor and film producer. Known for his work in biographical and period films, he is the recipient of numerous accolades, including an Academy Award, a British Academy Film Award and three Golden Globe Awards.","Born":{"$date":"1974-11-11T00:00:00Z"}},{"Name":"Tom Hanks","Bio":"Thomas Jeffrey Hanks is an American actor and filmmaker. Known for both his comedic and dramatic roles, he is one of the most popular and recognizable film stars worldwide, and is regarded as an American cultural icon.","Born":{"$date":{"$numberLong":"-425433600000"}}},{"Name":"Christopher Walken","Bio":"Christopher Walken is an American actor. Prolific in film, television, and on stage, Walken is the recipient of numerous accolades. He has earned an Academy Award, a BAFTA Award, a Screen Actors Guild Award, as well as nominations for two Primetime Emmy Awards and two Tony Awards.","Born":{"$date":{"$numberLong":"-844387200000"}}}]}
{"_id":{"$oid":"64ab0ba44e898f416195ff03"},"Title":"Inception","Description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.","Genre":{"Name":"Action","Description":"Action is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Edward Nolan CBE is a British and American filmmaker. Known for his Hollywood blockbusters with complex storytelling, Nolan is considered a leading filmmaker of the 21st century. His films have grossed $5 billion worldwide.","Born":{"$date":"1970-07-30T00:00:00Z"},"Movies":[[{"$oid":"64ab0ba44e898f416195ff03"},{"$oid":"64aa47004e898f416195ff01"}]]},"ImagePath":"inception.png","Featured":true,"Actors":[{"Name":"Leonardo DiCaprio","Bio":"Leonardo Wilhelm DiCaprio is an American actor and film producer. Known for his work in biographical and period films, he is the recipient of numerous accolades, including an Academy Award, a British Academy Film Award and three Golden Globe Awards.","Born":{"$date":"1974-11-11T00:00:00Z"}},{"Name":"Joseph Gordon-Levitt","Bio":"Joseph Leonard Gordon-Levitt is an American actor, writer, and director. He has received various accolades, including nominations for the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy for his leading performances in 500 Days of Summer and 50/50.","Born":{"$date":"1981-02-17T00:00:00Z"}},{"Name":"Elliot Page","Bio":"Elliot Page is a Canadian actor. He has received various accolades, including an Academy Award nomination, two BAFTA Awards and Primetime Emmy Award nominations, and a Satellite Award. Page was assigned female at birth, and later publicly came out as a trans man in December 2020.","Born":{"$date":"1987-02-21T00:00:00Z"}}]}
