{"_id":{"$oid":"64a885944e898f416195fee8"},"Name":"Gus Van Sant","Bio":"Gus Green Van Sant Jr. is an American film director, producer, photographer, and musician. He has earned acclaim as both an independent and mainstream filmmaker. His films typically deal with themes of marginalized subcultures, in particular homosexuality.","Birthday":{"$date":{"$numberLong":"-550368000000"}},"Movies":[{"$oid":"64a878a24e898f416195fee1"}]}
{"_id":{"$oid":"64a9bb9b4e898f416195fee9"},"Name":"David Fincher","Bio":"David Andrew Leo Fincher is an American filmmaker. His films, most of which are psychological thrillers, have collectively grossed over $2.1 billion worldwide and have received 10 Academy Award nominations; this includes three Best Director nominations for him.","Birthday":{"$date":{"$numberLong":"-231811200000"}},"Movies":[{"$oid":"64a87ad14e898f416195fee2"}]}
{"_id":{"$oid":"64a9bbf04e898f416195feea"},"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, writer, producer, and actor. His films are characterized by stylized violence, extended dialogue including a pervasive use of profanity, and references to popular culture.","Birthday":{"$date":{"$numberLong":"-213580800000"}},"Movies":[{"$oid":"64a9c4b04e898f416195fefa"}]}
{"_id":{"$oid":"64a9bc2f4e898f416195feeb"},"Name":"Edgar Wright","Bio":"Edgar Howard Wright is an English filmmaker. He is known for his fast-paced and kinetic, satirical genre films, which feature extensive utilisation of expressive popular music, Steadicam tracking shots, dolly zooms and a signature editing style that includes transitions, whip pans and wipes.","Birthday":{"$date":"1974-04-18T00:00:00Z"},"Movies":[{"$oid":"64a9c5324e898f416195fefb"}]}
{"_id":{"$oid":"64a9bc834e898f416195feec"},"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American filmmaker. He first came to public attention as the director of the action-adventure romantic comedy Romancing the Stone, the science-fiction comedy Back to the Future film trilogy, and the live-action/animated comedy Who Framed Roger Rabbit.","Birthday":{"$date":{"$numberLong":"-556502400000"}},"Movies":[{"$oid":"64aa43564e898f416195fefe"}]}
{"_id":{"$oid":"64a9bccd4e898f416195feed"},"Name":"Wes Anderson","Bio":"Wesley Wales Anderson is an American filmmaker. His films are known for their eccentricity, unique visual and narrative styles, and frequent use of ensemble casts. They often contain themes of grief, loss of innocence, and dysfunctional families. Anderson is cited by some critics as a modern-day example of an auteur.","Birthday":{"$date":{"$numberLong":"-21168000000"}},"Movies":[{"$oid":"64a9c7004e898f416195fefd"}]}
{"_id":{"$oid":"64a9bd1b4e898f416195feee"},"Name":"Tony Scott","Bio":"Anthony David Leighton Scott was an English film director and producer. He was known for directing highly successful action and thriller films such as Top Gun, Beverly Hills Cop II, Days of Thunder, The Last Boy Scout, True Romance, Crimson Tide, Enemy of the State, Man on Fire, Déjà Vu, and Unstoppable.","Birthday":{"$date":{"$numberLong":"-805680000000"}},"Death":{"$date":"2012-08-19T00:00:00Z"},"Movies":[{"$oid":"64aa44124e898f416195feff"}]}
{"_id":{"$oid":"64a9bd5a4e898f416195feef"},"Name":"Peter Weir","Bio":"Peter Lindsay Weir AM is a retired Australian film director. He is known for directing films crossing various genres over forty years with films such as Picnic at Hanging Rock, Gallipoli, Witness, Dead Poets Society, Fearless, The Truman Show, Master and Commander: The Far Side of the World, and The Way Back.","Birthday":{"$date":{"$numberLong":"-800409600000"}},"Movies":[{"$oid":"64aa46074e898f416195ff00"}]}
{"_id":{"$oid":"64a9bd914e898f416195fef0"},"Name":"Christopher Nolan","Bio":"Christopher Edward Nolan CBE is a British and American filmmaker. Known for his Hollywood blockbusters with complex storytelling, Nolan is considered a leading filmmaker of the 21st century. His films have grossed $5 billion worldwide.","Birthday":{"$date":"1970-07-30T00:00:00Z"},"Movies":[{"$oid":"64aa47004e898f416195ff01"},{"$oid":"64ab0ba44e898f416195ff03"}]}
{"_id":{"$oid":"64a9bdcb4e898f416195fef1"},"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. A major figure of the New Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director in history.","Birthday":{"$date":{"$numberLong":"-727056000000"}},"Movies":[{"$oid":"64aa47034e898f416195ff02"}]}
